Project/Toir/src/InformationRegisters/торо_ПорядокОРПоИерархии/торо_ПорядокОРПоИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПорядокОРПоИерархии</name>
  <resources>
    <name>РеквизитДопУпорядочиванияОР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/CommonModules/торо_НастройкаПорядкаЭлементов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// торо_НастройкаПорядкаЭлементов: методы, для работы с порядком элементо
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
// Заполняет значение реквизита дополнительного упорядочивания у объекта.
//
// Параметры:
//		Ссылка - Объект - записываемый объект;
//		СтруктураИерархии - СправочникСсылка.торо_СтруктурыОР - структура иерархии.
//		Отказ - Булево - признак отказа от записи объекта.
//		УстанавливаемоеЗначение - Число - значение реквизита доп. упорядочивания, которое нужно установить.
//													Если не задано, то рассчитывается автоматически.
//
Процедура ЗаполнитьЗначениеРеквизитаУпорядочивания(Ссылка, СтруктураИерархии, Отказ, УстанавливаемоеЗначение = Неопределено) Экспорт
	
	// Если в обработчике был установлен отказ новый порядок не вычисляем
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Вычислим новое значение для порядка элемента
	НаборЗаписей = РегистрыСведений.торо_ПорядокОРПоИерархии.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(Ссылка);
	НаборЗаписей.Отбор.СтруктураИерархии.Установить(СтруктураИерархии);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НС = НаборЗаписей.Добавить();
	НС.ОбъектРемонта = Ссылка;
	НС.СтруктураИерархии = СтруктураИерархии;
	Если УстанавливаемоеЗначение = Неопределено Тогда
		НС.РеквизитДопУпорядочиванияОР = ПолучитьМаксимальноеЗначениеРеквизитаДопУпорядоивания(СтруктураИерархии);
	Иначе
		НС.РеквизитДопУпорядочиванияОР = УстанавливаемоеЗначение;
	КонецЕсли;
	НаборЗаписей.Записать();
						
КонецПроцедуры

// Возвращает максимальное значение реквизита доп. упорядочивания.
// Параметры:
//		Иерархия - СправочникСсылка.торо_СтруктурыОР - структура иерархии.
// Возвращаемое значение:
//		Число - максимальное значение.
Функция ПолучитьМаксимальноеЗначениеРеквизитаДопУпорядоивания(Иерархия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.РеквизитДопУпорядочиванияОР КАК РеквизитДопУпорядочивания
	|ИЗ
	|	РегистрСведений.торо_ПорядокОРПоИерархии КАК Таблица
	|ГДЕ
	|	Таблица.СтруктураИерархии = &СтруктураИерархии
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания УБЫВ";
	
	Запрос.УстановитьПараметр("СтруктураИерархии", Иерархия);
	
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда 
		возврат 1; 
	КонецЕсли;
	
	Выборка = РезЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.РеквизитДопУпорядочивания + 1;	
	
КонецФункции

#КонецОбласти
